tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Core
brew "git"
brew "wget"
brew "curl"
brew "jq"
brew "stow"

# Shell & Productivity
brew "zsh"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"
brew "zoxide"
brew "direnv"
brew "tldr"

# Development
brew "neovim"
brew "tmux"
brew "nodenv"
brew "pyenv"
brew "go"

# GUI & Fonts
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
cask "google-cloud-sdk"
